[Subtitles]
Loading="Loading..."
StartToContinue="Press START to Continue"
Cin0Line1="<COLOR: 200, 10, 255>Etheria</COLOR> was once a land of <COLOR:35,95,255>living legends</COLOR>..."
Cin0Line2="Long ago, <COLOR:35,95,255>brave warriors</COLOR> across the realm stood together against an immortal evil known as the <COLOR:255,35,35>Old Ones</COLOR>..."
Cin0Line3="In the wake of this struggle, the <COLOR:35,95,255>champions</COLOR> locked away the power of the <COLOR:255,35,35>Old Ones</COLOR> inside <COLOR: 200, 10, 255>Eternia Crystals</COLOR>..."
Cin0Line4="Recently, the realm's <COLOR:35,95,255>Heroes</COLOR>, called to a far away crusade, have left their <COLOR: 0,211,184>younger kin</COLOR> to tend the castle and its chores..."
Cin0Line5="Bored with their dreary duties, and imagining <COLOR:43,106,222>action</COLOR> and <COLOR:255,90,48>adventure</COLOR>..."
Cin0Line6="The <COLOR: 0,211,184>pupils</COLOR> accidentally unleash an <COLOR:126,79,159>ancient force</COLOR> that has long been dormant!"
Cin0Line7="Now these <COLOR: 0,211,184>Heroes-in-training</COLOR> will have to grow up quickly. Together they will defend the <COLOR: 200, 10, 255>Eternia Crystals</COLOR> against those who would seek to resurrect the <COLOR:126,79,159>ancient evils</COLOR>!"
Cin1Line1="The <COLOR: 0,173,12>Huntress</COLOR>, <COLOR: 255,0,0>Squire</COLOR>, <COLOR: 88,100,255>Apprentice</COLOR>, and <COLOR: 255, 99, 0>Monk</COLOR> arrive at the castle's interior, exhausted after their epic battle with the terrifying monstrosity..."
Cin1Line2="The <COLOR: 88,100,255>Apprentice</COLOR> wonders where these dastardly creatures are coming from..."
Cin1Line3="The <COLOR: 0,173,12>Huntress</COLOR> remarks that evil beings must be drawn toward the energies contained within the <COLOR: 200, 10, 255>Eternia Crystals</COLOR>..."
Cin1Line4="The <COLOR: 255, 99, 0>Monk</COLOR>, who has taken a vow of silence, stoically stares off into the distance, as if remembering something from a dream."
Cin1Line5="The <COLOR: 255,0,0>Squire</COLOR> boasts that it doesn't matter where their opponents hail from, as long as they fall beneath his sword..."
Cin1Line6="On that the team agrees, and forges on into the castle to turn back the tide."
Cin2Line1="Though the royal <COLOR: 200,10,255>Throne Room</COLOR> is in shambles, the four enjoy their victory over the <COLOR: 0,173,12>Goblin Army's</COLOR> mechanical contraption..."
Cin2Line2="But this joyful respite is rudely interrupted by a thunderous roar from outside!"
Cin2Line3="Racing to the rooftops, they turn their eyes to the sky and see a gargantuan <COLOR:107,47,148>dragon</COLOR> circling over head, rallying his troops for the final assault!"
Cin2Line4="The four <COLOR: 0,211,184>defenders</COLOR> ready themselves for the ultimate battle ahead!"
Cin3Line1="The foul <COLOR:107,47,148>beast</COLOR>, broken and defeated by the team's relentless attack, collapses, plummeting to the ground in a ball of flame."
Cin3Line2="With their final foe defeated, the pupils - nay... <COLOR: 0,211,184>Heroes</COLOR>! - gather together and celebrate their victory."
Cin3Line3a="The <COLOR: 88,100,255>Apprentice</COLOR> stands in awe of the true energy contained within the <COLOR: 200, 10, 255>Eternia Crystals</COLOR>, contemplating ways to use this power for the forces of light."
Cin3Line3b="The <COLOR: 255,0,0>Squire</COLOR> raises his fist to the sky, and realizes that the purest form of strength is the willpower to do what is right."
Cin3Line3c="The <COLOR: 0,173,12>Huntress</COLOR> slips back into the shadows, wondering what dark secrets the Castle may yet hold..."
Cin3Line3d="The <COLOR: 255, 99, 0>Monk</COLOR> meditates over the carnage that has been wrought, then turns to his companions and laughs aloud with them."
Cin3Line4="And one thing is certain for all: the realm of <COLOR: 200, 10, 255>Etheria</COLOR> is now protected by a new generation of <COLOR:35,95,255>legends</COLOR>..."
Cin3Line5="And the <COLOR:255,35,35>Old Ones</COLOR> will not see the light of day under <COLOR:35,95,255>their</COLOR> watch!"
Tutorial1="Welcome to the <COLOR: 255, 60, 10>Dungeons of Etheria</COLOR>!"
Tutorial2="I will attempt to teach you the basic arts of <COLOR: 255,246,0>Dungeon Defense</COLOR>."
Tutorial3="Your mission is to defend the <COLOR: 200, 10, 255>Eternia Crystals</COLOR> against all opposition through <COLOR: 255, 99, 0>Waves</COLOR> of enemy attacks."
Tutorial4="You can move around the area with the <IMG:Texture2D'GamePadButtons_360.Textures.L_biDirectional_Analog'>, and you can press the <IMG:Texture2D'GamepadButtons_360.Textures.bottomButton'> to Jump."
Tutorial5="You can tilt the <IMG:Texture2D'GamePadButtons_360.Textures.R_biDirectional_Analog'> to rotate the camera; press the <IMG:Texture2D'GamepadButtons_360.Textures.R_Down_Analog'> to cycle through camera zoom levels."
Tutorial6="Hold the <IMG:Texture2D'GamepadButtons_360.Textures.L_01'> to display the area map."
Tutorial7="While in the '<COLOR: 70,211,0>Build Phase</COLOR>,' you should summon <COLOR: 255,246,0>Defenses</COLOR> in order to protect your <COLOR: 200, 10, 255>Eternia Crystals</COLOR>."
Tutorial8="To Summon <COLOR: 255,246,0>Defenses</COLOR>, first open your <COLOR: 0,173,12>Action Wheel</COLOR> by pressing the <IMG:Texture2D'GamepadButtons_360.Textures.R_01'>."
Tutorial9="Then, use the <IMG:Texture2D'GamePadButtons_360.Textures.R_biDirectional_Analog'> to select '<COLOR: 255,246,0>Summon Defenses</COLOR>' from the <COLOR: 0,173,12>Action Wheel</COLOR>"
Tutorial10="To decide where to place the <COLOR: 255,246,0>Defense</COLOR>, move it with the <IMG:Texture2D'GamePadButtons_360.Textures.L_biDirectional_Analog'> and then press the <IMG:Texture2D'GamepadButtons_360.Textures.bottomButton'> to confirm."
Tutorial11="You may only place your <COLOR: 255,246,0>Defense</COLOR> within a radius around yourself, and <COLOR: 255,246,0>Defenses</COLOR> generally need enough free area to be summoned to a location."
Tutorial12="Summoning <COLOR: 255,246,0>Defenses</COLOR> consumes <COLOR: 43,106,222>Mana Power</COLOR>, which is the magical resource used for all of your <COLOR: 255,0,0>Hero Abilities</COLOR> and to upgrade your equipment."
Tutorial13="From the <COLOR: 0,173,12>Action Wheel</COLOR>, you can '<COLOR: 43,106,222>Repair</COLOR>' your <COLOR: 255,246,0>Defenses</COLOR>, '<COLOR: 200,10,255>Upgrade</COLOR>' them, or even '<COLOR: 70, 211, 0>Sell</COLOR>' them."
Tutorial14="Notice the billboard in front of each '<COLOR: 129,129,129>Creep Door</COLOR>' displaying the number and types of enemies that will be advancing from that location."
Tutorial15="Use this information to better plan your defensive strategy."
Tutorial16="Once you are ready to face your enemies, head to the <COLOR: 200, 10, 255>Eternia Crystal</COLOR> and activate it with <IMG:Texture2D'GamepadButtons_360.Textures.leftButton'> to proceed to the '<COLOR: 226,0,0>Combat Phase</COLOR>.'"
Tutorial17="Press the <IMG:Texture2D'GamepadButtons_360.Textures.R_02'> to use your primary attack. Press the <IMG:Texture2D'GamepadButtons_360.Textures.L_02'> to use your <COLOR: 255,0,0>Hero's</COLOR> unique, secondary attack."
Tutorial18="You can also bind any <COLOR: 255, 99, 0>Ability</COLOR> to a hot-key by selecting that <COLOR: 255, 99, 0>Ability</COLOR> in the <COLOR: 0,173,12>Action Wheel</COLOR> and holding the <IMG:Texture2D'GamepadButtons_360.Textures.directionalPad_Left'>, <IMG:Texture2D'GamepadButtons_360.Textures.directionalPad_Down'>, <IMG:Texture2D'GamepadButtons_360.Textures.directionalPad_Up'>, and <IMG:Texture2D'GamepadButtons_360.Textures.directionalPad_Right'>."
Tutorial19="Then, you can quickly activate that <COLOR: 255, 99, 0>Ability</COLOR> by simply pressing the corresponding hot-key."
Tutorial20="You can <COLOR: 0,211,184>Heal</COLOR> yourself by opening the <COLOR: 0,173,12>Action Wheel</COLOR>, activating the <COLOR: 255,0,0>Hero</COLOR> icon, and then activating your '<COLOR: 0,211,184>Heal Self</COLOR>' ability."
Tutorial21="Enemies cannot be harmed within the <COLOR:118,76,147>Dark Energy</COLOR> around the <COLOR: 129,129,129>Creep Door</COLOR> so only attack them once they become vulnerable."
Tutorial22="Some monsters have an <COLOR:191,175,0>Elemental Alignment</COLOR>."
Tutorial23="These monsters emanate <COLOR:255,0,0>Fire</COLOR><IMG:Texture2D'DunDefUI_HeroInfo.Textures.Stat_Icon_DamageResistance_Fire'>, <COLOR:0,211,184>Lightning</COLOR><IMG:Texture2D'DunDefUI_HeroInfo.Textures.Stat_Icon_DamageResistance_Lightning'>, or <COLOR:0,173,12>Poison</COLOR><IMG:Texture2D'DunDefUI_HeroInfo.Textures.Stat_Icon_DamageResistance_Poison'>, and are marked with the icon of the element they are immune to."
Tutorial24="Certain <COLOR: 255,246,0>Defenses</COLOR> also have an <COLOR:191,175,0>Elemental Alignment</COLOR>, in which case they will be ineffective against such enemies."
Tutorial25="You can use any equipment that you find by pressing the <IMG:Texture2D'GamepadButtons_360.Textures.topButton'> when you are near it."
Tutorial26="Pay close attention: Equipment that may be better than what you are currently using is highlighted in green."
Tutorial27="Equipment will enhance your <COLOR: 255,0,0>Hero's</COLOR> statistics, which are viewable by pressing the <IMG:Texture2D'GamepadButtons_360.Textures.SelectButton'>."
Tutorial28="Each <COLOR: 255,0,0>Hero</COLOR> may equip a Helmet, Torso Armor, Gloves, Boots, a class-specific Weapon, and a pet."
Tutorial29="You may store excess equipment in your <COLOR: 0,211,184>Item Box</COLOR> by highlighting dropped equipment and pressing the <IMG:Texture2D'GamepadButtons_360.Textures.leftButton'>."
Tutorial30="By defeating enemies and completing <COLOR: 255, 99, 0>Waves</COLOR>, you may earn enough experience to <COLOR: 191,175,0>Level Up</COLOR>."
Tutorial31="These earned skill points may be applied during the '<COLOR: 70,211,0>Build Phase</COLOR>' through your <COLOR:255,0,0>Hero Info</COLOR>, which is accessed with the <IMG:Texture2D'GamepadButtons_360.Textures.SelectButton'>."
Tutorial32="If you do not wish to apply a <COLOR: 191,175,0>Level Up</COLOR> immediately, you can apply skill points later from the <COLOR: 0,211,184>Forge</COLOR>."
Tutorial33="When close to the <COLOR: 0,211,184>Forge</COLOR>, press the <IMG:Texture2D'GamepadButtons_360.Textures.leftButton'> to open it."
Tutorial34="At the end of each <COLOR: 255, 99, 0>Wave</COLOR>, excess <COLOR: 43,106,222>Mana</COLOR> is automatically stored in your <COLOR: 0,211,184>Forge's</COLOR> '<COLOR: 43,106,222>Mana Bank</COLOR>.'"
Tutorial35="You can invest <COLOR: 43,106,222>Mana</COLOR> in equipment items to upgrade them for increased powers!"
Tutorial36="You may also <COLOR: 255,0,0>Swap Heroes</COLOR> at the <COLOR: 0,211,184>Forge</COLOR>, allowing you to gain the benefits of each <COLOR:255,0,0>Hero</COLOR> classes' <COLOR: 255,246,0>Defenses</COLOR>."
Tutorial37="The <COLOR: 0,211,184>Forge</COLOR> may only be accessed during the '<COLOR: 70,211,0>Build Phase</COLOR>' so be sure to plan ahead!"
Tutorial38="Remember well what I have taught you, but if you forget you may access this training session from the <COLOR:43,106,222>Options Menu</COLOR>."
Tutorial39="Good hunting, <COLOR:255,0,0>Hero</COLOR>!"
Tutorial4PC="You can move around the area with the [W], [A], [S], and [D] keys, and you can press the [Space] bar to Jump."
Tutorial5PC="You can hold the [Control] button and move the mouse to rotate the Camera; scroll the [Mouse Wheel] to cycle through camera zoom levels."
Tutorial6PC="Hold [Shift] to display the area map."
Tutorial8PC="To Summon Defenses, first open your Action Wheel by pressing the [Middle Mouse] button."
Tutorial9PC="Then, use the [Mouse] to select 'Summon Defenses' from the Action Wheel."
Tutorial10PC="To decide where to place the Defense, move it with the [Mouse] and then click the [Left Mouse] button to confirm."
Tutorial16PC="Once you are ready to face your enemies, head to the Eternia Crystal and activate it with the [E] key to proceed to the 'Combat Phase.'"
Tutorial17PC="Click the [Left Mouse Button] to use your primary attack and the [Right Mouse Button] to use your Hero's unique, secondary attack."
Tutorial18PC="You can also bind any Ability to a hot-key by selecting that Ability in the Action Wheel and holding the [Numeric Keys]."
Tutorial25PC="You can use any equipment that you find by pressing the [F] key when you are near it."
Tutorial27PC="Equipment will enhance your Hero's statistics, which are viewable by pressing the [I] key."
Tutorial29PC="You may store excess equipment in your Item Box by highlighting dropped equipment and pressing the [E] key."
Tutorial31PC="These earned skill points may be applied during the 'Build Phase' through your Hero Info, which is accessed with the [I] key."
Tutorial33PC="When close to the Forge, press the [E] key to open it."
